namespace NovelsRanboeTranslates.Domain.Lists
{
    public class Genres
    {
        List<string> Genre = new List<string>()
            {
            "Бойовик", "Бойові Мистецтва", "Гарем", "Героїчне Фентезі", "міське Фентезі",
            "Джьосей", "Драма", "Історія", "Кодомо", "Комедія", "Кіберпанк", "ЛітRPG",
            "Містика", "Наукова фантастика", "Повсякденність", "Постапокаліпсис", "Пригоди",
            "Психологія", "Романтика", "Надприродне", "Сьодзьо", "Сьонен", "Спорт", "Сейнен",
            "Трагедія", "Трилер", "Жахи", "Фантастика", "Фентезі", "Школа", "Еротика", "Етті", "Юрі", "Яой"
            };



        public void AddItem(string item)
        {
            Genre.Add(item);
        }

        public List<string> GetList()
        {
            return Genre;
        }
    }
}
