namespace NovelsRanboeTranslates.Domain.Lists
{
    public class Genres
    {
        List<string> Genre = new List<string>()
        {
            "Арт", "Безумие", "Боевик", "Боевые искуства", "Вампиры", "Гарем", "Гендерная интрига", "Героическое фентези", "Демоны", "Детектив", "Детское", "Дзёсэй", "Драма", "Игра", "Исекай",
            "История", "Киберпанк", "Кодомо", "Комедия", "Космос", "Магия", "Махо-Сёдзё", "Машины", "Меха", "Мистика", "Музыка", "Научная фантасткика", "Омегаверс", "Пародия", "Повседневность",
            "Полиция", "Постапокалиптика", "Приключения", "Психология", "Романтика", "Самурайский боевик", "Сверхъестественное", "Сёдзё", "Сёдзё-ай", "Сёнэн", "Сёнэн-ай", "Спорт", "Супер сила",
            "Сэйнэй", "Трагедия", "Триллер", "Ужасы", "Фантастика", "Фэнтези", "Школа", "Эротика", "Этти", "Юри", "Яой" };
       
        public void AddItem(string item)
        {
            Genre.Add(item);
        }

        public List<string> GetList()
        {
            return Genre;
        }
    }
}
